# -*- coding: utf-8 -*-
AREANUM2NAME = {
    34: "澳门",
    33: "香港",
    32: "台湾",
    31: "新疆维吾尔自治区",
    30: "宁夏回族自治区",
    29: "西藏自治区",
    28: "广西壮族自治区",
    27: "内蒙古自治区",
    26: "青海省",
    25: "甘肃省",
    24: "陕西省",
    23: "云南省",
    22: "贵州省",
    21: "四川省",
    20: "海南省",
    19: "广东省",
    18: "湖南省",
    17: "湖北省",
    16: "河南省",
    15: "山东省",
    14: "江西省",
    13: "福建省",
    12: "安徽省",
    11: "浙江省",
    10: "江苏省",
    9: "黑龙江省",
    8: "吉林省",
    7: "辽宁省",
    6: "山西省",
    5: "河北省",
    4: "重庆市",
    3: "天津市",
    2: "上海市",
    1: "北京市",
}

AREANAME2NUM = {v[0: 9]: k for k, v in AREANUM2NAME.items()}

print AREANAME2NUM

print '\xe6\xb1\x9f\xe8\x8b\x8f\xe7\x9c\x81'